elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
RuntimeAudioAutomation runtimeAudio;

struct PhysicalButtonState {
    int8_t configuredIndex = -1;
    uint8_t controlSlot = 0;
    uint8_t pin = 0;
    const char* label = "";
    String profileValue = "none";
    bool limitSwitch = false;
    bool normallyClosed = false;
    bool limitSwitchUsesPullup = true;
    bool limitSwitchActiveHigh = false;
    bool nativeTouch = false;
    bool touchSupported = false;
    bool mainControlEnabled = false;
    uint8_t sensitivityPercent = 55;
    uint16_t touchRawValue = 0;
    uint16_t touchBaselineValue = 0;
    uint8_t touchPressCandidateCount = 0;
    uint8_t touchReleaseCandidateCount = 0;
    bool lastSampledPressed = false;
    bool stablePressed = false;
    bool holdResetTriggered = false;
    unsigned long lastTransitionAt = 0;
    unsigned long pressedSinceAt = 0;
};

struct PlaybackHistoryEntry {
    String url;
    String label;
    String type;
    String source;
};

bool rebootRequested = false;
bool factoryResetRequested = false;
unsigned long rebootAt = 0;
unsigned long factoryResetLedBlinkUntil = 0;
bool touchStatusLedOverrideActive = false;
unsigned long lastHeapUpdateAt = 0;
bool recoveryRebootScheduled = false;
bool wokeFromDeepSleep = false;
uint8_t activeI2sBclkPin = DefaultConfig::I2S_BCLK_PIN;
uint8_t activeI2sWsPin = DefaultConfig::I2S_WS_PIN;
uint8_t activeI2sDoutPin = DefaultConfig::I2S_DOUT_PIN;
bool activeAudioOutputEnabled = true;
uint8_t activeWapeTriggerPin = 0;
bool wapeTriggerInitialized = false;
bool wapePulseActive = false;
unsigned long wapePulseReleaseAt = 0;
unsigned long lowBatteryWakeStartedAt = 0;
unsigned long lastOtaMqttPublishAt = 0;
bool previousWifiConnected = false;
bool previousMqttConnected = false;
bool previousCharging = false;
String previousPlaybackState = "idle";
String previousPlaybackSource = "none";
String previousPlaybackType = "idle";
String lastPublishedOtaSignature;
bool transitionStateInitialized = false;
bool otaPendingVerification = false;
bool otaHealthConfirmed = false;
unsigned long otaBootStartedAt = 0;
bool powerCycleCounterClearArmed = false;
unsigned long powerCycleCounterClearAt = 0;
unsigned long lastInputPollAt = 0;
String otaPendingVersion;
String lastRolledBackVersion;
String lastRollbackReason;
uint32_t lastPublishedMotorStateVersion = 0;

constexpr float kBatteryPercentEmptyVoltage = 3.2f;
constexpr float kBatteryPercentFullVoltage = 4.2f;
constexpr unsigned long kTouchFactoryResetHoldMs = 10000UL;
constexpr unsigned long kFactoryResetLedBlinkIntervalMs = 500UL;
constexpr unsigned long kFactoryResetLedSuccessWindowMs = 1500UL;
constexpr unsigned long kLowBatteryWakeWindowMs = 30000UL;
constexpr unsigned long kVolumePersistDelayMs = 750UL;
constexpr unsigned long kButtonDebounceMs = 30UL;
constexpr unsigned long kTouchDebounceMs = 20UL;
constexpr unsigned long kInputPollIntervalMs = 4UL;
constexpr uint8_t kDefaultTouchSensitivityPercent = 55;
constexpr size_t kMaxPeripheralInputProfiles = 10;
constexpr uint8_t kTouchPressCandidateSamples = 3;
constexpr uint8_t kTouchReleaseCandidateSamples = 3;
constexpr size_t kPlaybackHistoryLimit = 12;
constexpr unsigned long kOtaHealthConfirmDelayMs = 8000UL;
constexpr unsigned long kWapePulseDurationMs = 500UL;
constexpr unsigned long kStartupEffectDelayMs = 1200UL;
constexpr unsigned long kStartupEffectRetryDelayMs = 1500UL;
constexpr uint8_t kStartupEffectMaxAttempts = 5;
constexpr unsigned long kAmbientResumeDelayMs = 30000UL;
constexpr unsigned long kRestartEffectForceDelayMs = 7000UL;
constexpr unsigned long kEffectPreviewRetryDelayMs = 150UL;
constexpr unsigned long kPowerCycleCounterClearDelayMs = 10000UL;
constexpr uint8_t kPowerCycleFactoryResetThreshold = 7;

constexpr char kOtaRollbackNamespace[] = "ota_state";
constexpr char kOtaPendingVersionKey[] = "pend_ver";
constexpr char kOtaPendingReasonKey[] = "pend_reason";
constexpr char kOtaLastBadVersionKey[] = "bad_ver";
constexpr char kOtaLastBadReasonKey[] = "bad_reason";
constexpr char kPowerCycleNamespace[] = "boot_guard";
constexpr char kPowerCycleCountKey[] = "pc_count";

bool playRequest(const String& url, const String& label, const String& type, const String& source, String& error, bool addToHistory);
void flushPendingSettingsNow();
void restoreAmbientVolumeIfNeeded();

bool isResumablePlaybackSelection(const String& url, const String& type, const String& source) {
    String normalizedUrl = url;
    normalizedUrl.trim();
    if (normalizedUrl.isEmpty()) {
        return false;
    }

    String normalizedType = type;
    normalizedType.trim();
    normalizedType.toLowerCase();
    if (normalizedType != "stream" && normalizedType != "media") {
        return false;
    }

    String normalizedSource = source;
    normalizedSource.trim();
    normalizedSource.toLowerCase();
    return !normalizedSource.startsWith("effect-");
}

bool parseSavedPlaybackReference(const String& raw, StorageTarget& target, String& path) {
    String value = raw;
    value.trim();
    value.replace('\\', '/');

    const int separatorIndex = value.indexOf(':');
    if (separatorIndex <= 0) {
        return false;
    }

    String targetId = value.substring(0, separatorIndex);
    targetId.trim();
    targetId.toLowerCase();
    if (targetId == "sd") {
        target = StorageTarget::Sd;
    } else if (targetId == "flash") {
        target = StorageTarget::Flash;
    } else {
        return false;
    }

    path = value.substring(separatorIndex + 1);
    path.trim();
    if (path.isEmpty()) {
        return false;
    }
    if (!path.startsWith("/")) {
        path = "/" + path;
    }
    while (path.indexOf("//") >= 0) {
        path.replace("//", "/");
    }
    if (path.indexOf("..") >= 0) {
        return false;
    }

    return true;
}

String canonicalPlaybackReference(const String& url) {
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    if (parseSavedPlaybackReference(url, storageTarget, storagePath)) {
        return String(storageTargetId(storageTarget)) + ":" + storagePath;
    }
    return PlaybackText::normalizeUrl(url);
}

