elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
void syncPendingLastPlaybackSettings() {
    if (deferredActions != nullptr && deferredActions->settingsApplyPending) {
        deferredActions->pendingSettings.audio.lastPlayback = settings->audio.lastPlayback;
    }
}

void setSavedPlaybackResumeAfterBoot(bool resumeAfterBoot) {
    if (settings == nullptr || settingsManager == nullptr || !settings->audio.rememberLastPlayed) {
        return;
    }

    AudioSettings::LastPlaybackSettings& lastPlayback = settings->audio.lastPlayback;
    if (lastPlayback.resumeAfterBoot == resumeAfterBoot ||
        !isResumablePlaybackSelection(lastPlayback.url, lastPlayback.type, lastPlayback.source)) {
        return;
    }

    lastPlayback.resumeAfterBoot = resumeAfterBoot;
    syncPendingLastPlaybackSettings();
    settingsManager->save(*settings);
}

void persistResumablePlaybackSelection(const String& url, const String& label, const String& type, const String& source, bool resumeAfterBoot = true) {
    if (settings == nullptr || settingsManager == nullptr || !settings->audio.rememberLastPlayed || !isResumablePlaybackSelection(url, type, source)) {
        return;
    }

    const String normalizedUrl = canonicalPlaybackReference(url);
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    const bool storageReference = parseSavedPlaybackReference(normalizedUrl, storageTarget, storagePath);
    const String normalizedLabel = storageReference
        ? PlaybackText::normalizeTitle(label, storagePath)
        : PlaybackText::normalizeTitle(label, normalizedUrl);
    String normalizedType = type;
    normalizedType.trim();
    normalizedType.toLowerCase();
    String normalizedSource = source;
    normalizedSource.trim();

    AudioSettings::LastPlaybackSettings& lastPlayback = settings->audio.lastPlayback;
    if (lastPlayback.url == normalizedUrl && lastPlayback.label == normalizedLabel && lastPlayback.type == normalizedType &&
        lastPlayback.source == normalizedSource && lastPlayback.resumeAfterBoot == resumeAfterBoot) {
        return;
    }

    lastPlayback.url = normalizedUrl;
    lastPlayback.label = normalizedLabel;
    lastPlayback.type = normalizedType;
    lastPlayback.source = normalizedSource;
    lastPlayback.resumeAfterBoot = resumeAfterBoot;
    syncPendingLastPlaybackSettings();
    settingsManager->save(*settings);
}

bool queueSavedPlaybackResume() {
    if (settings == nullptr) {
        return false;
    }

    const AudioSettings::LastPlaybackSettings& lastPlayback = settings->audio.lastPlayback;
    if (!settings->audio.rememberLastPlayed || !lastPlayback.resumeAfterBoot || !isResumablePlaybackSelection(lastPlayback.url, lastPlayback.type, lastPlayback.source)) {
        return false;
    }

    String error;
    const bool queued = playRequest(lastPlayback.url, lastPlayback.label, lastPlayback.type, lastPlayback.source, error, false);
    if (!queued && !error.isEmpty()) {
        Serial.printf("[audio] saved playback resume skipped: %s\n", error.c_str());
    }
    return queued;
}

bool parseStorageFileReference(const String& raw, StorageTarget& target, String& path) {
    String value = raw;
    value.trim();
    value.replace('\\', '/');

    const int separatorIndex = value.indexOf(':');
    if (separatorIndex <= 0) {
        return false;
    }

    String targetId = value.substring(0, separatorIndex);
    targetId.trim();
    targetId.toLowerCase();
    if (targetId == "sd") {
        target = StorageTarget::Sd;
    } else if (targetId == "flash") {
        target = StorageTarget::Flash;
    } else {
        return false;
    }

    path = value.substring(separatorIndex + 1);
    path.trim();
    if (path.isEmpty()) {
        return false;
    }
    if (!path.startsWith("/")) {
        path = "/" + path;
    }
    while (path.indexOf("//") >= 0) {
        path.replace("//", "/");
    }
    if (path.indexOf("..") >= 0) {
        return false;
    }

    return true;
}

PhysicalButtonState button1 { -1, 0, DefaultConfig::BUTTON1_PIN, "Button 1" };
PhysicalButtonState button2 { -1, 1, DefaultConfig::BUTTON2_PIN, "Button 2" };
MotorController motorController;
PlaybackHistoryEntry playbackHistory[kPlaybackHistoryLimit];
size_t playbackHistoryCount = 0;
int playbackHistoryIndex = -1;

bool isNativeTouchProfileValue(const String& profileValue) {
    String normalized = profileValue;
    normalized.trim();
    normalized.toLowerCase();
    return normalized == "esp32-native-touch-pad";
}

bool isLimitSwitchProfileValue(const String& profileValue) {
    String normalized = profileValue;
    normalized.trim();
    normalized.toLowerCase();
    return normalized == "limit-switch";
}

bool isTouchCapablePin(uint8_t pin) {
#if defined(CONFIG_IDF_TARGET_ESP32)
    switch (pin) {
        case 0:
        case 2:
        case 4:
        case 12:
        case 13:
        case 14:
        case 15:
        case 27:
        case 32:
        case 33:
            return true;
        default:
            return false;
    }
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
    return pin >= 1 && pin <= 14;
#else
    (void)pin;
    return false;
#endif
}

String peripheralInputProfileFromUi(size_t index) {
    if (settings == nullptr) {
        return String("none");
    }

    const String rawSelections = settings->ui.peripheralProfileSelections;
    if (rawSelections.isEmpty()) {
        return String("none");
    }

    JsonDocument document;
    if (deserializeJson(document, rawSelections) != DeserializationError::Ok) {
        return String("none");
    }

    JsonArrayConst inputs = document["inputs"].as<JsonArrayConst>();
    if (inputs.isNull() || index >= inputs.size() || !inputs[index].is<const char*>()) {
        return String("none");
    }

    String profile = inputs[index].as<const char*>();
    profile.trim();
    profile.toLowerCase();
    return profile.isEmpty() ? String("none") : profile;
}

String peripheralInputHelperValue(size_t index, const char* key) {
    if (settings == nullptr || key == nullptr || settings->ui.peripheralHelperBindings.isEmpty()) {
        return "";
    }

