elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    JsonDocument document;
    if (deserializeJson(document, settings->ui.peripheralHelperBindings) != DeserializationError::Ok) {
        return "";
    }

    const String slotKey = String("input:") + index;
    JsonObjectConst slot = document[slotKey].as<JsonObjectConst>();
    if (slot.isNull() || !slot[key].is<const char*>()) {
        return "";
    }

    String value = slot[key].as<const char*>();
    value.trim();
    return value;
}

uint8_t configuredInputPin(size_t index, const String& profileValue, uint8_t fallbackPin) {
    String rawValue;
    if (isNativeTouchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "TOUCH");
    } else if (isLimitSwitchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "COM");
        if (rawValue.isEmpty()) {
            rawValue = peripheralInputHelperValue(index, "SIG");
        }
    } else {
        rawValue = peripheralInputHelperValue(index, "SIG");
    }
    const int numericPin = rawValue.isEmpty() ? -1 : rawValue.toInt();
    if (numericPin < 0 || numericPin > 255) {
        return fallbackPin;
    }
    return static_cast<uint8_t>(numericPin);
}

uint8_t configuredTouchSensitivity(size_t index) {
    const String rawValue = peripheralInputHelperValue(index, "SENSITIVITY");
    const int numericValue = rawValue.isEmpty() ? static_cast<int>(kDefaultTouchSensitivityPercent) : rawValue.toInt();
    if (numericValue < 5) {
        return 5;
    }
    if (numericValue > 100) {
        return 100;
    }
    return static_cast<uint8_t>(numericValue);
}

bool configuredLimitSwitchNormallyClosed(size_t index) {
    String contactValue = peripheralInputHelperValue(index, "CONTACT");
    contactValue.trim();
    contactValue.toUpperCase();
    return contactValue == "NC";
}

bool configuredLimitSwitchSwitchedToVcc(size_t index) {
    String sourceValue = peripheralInputHelperValue(index, "SOURCE");
    sourceValue.trim();
    sourceValue.toUpperCase();
    return sourceValue == "VCC";
}

bool configuredTouchMainControlEnabled(size_t index) {
    String flagValue = peripheralInputHelperValue(index, "MAIN_CONTROL");
    flagValue.trim();
    flagValue.toLowerCase();
    return flagValue == "1" || flagValue == "true" || flagValue == "on" || flagValue == "yes";
}

void applyButtonProfileConfig(PhysicalButtonState& button, size_t index, uint8_t fallbackPin) {
    button.configuredIndex = static_cast<int8_t>(index);
    button.profileValue = peripheralInputProfileFromUi(index);
    button.pin = configuredInputPin(index, button.profileValue, fallbackPin);
    button.limitSwitch = isLimitSwitchProfileValue(button.profileValue);
    button.normallyClosed = button.limitSwitch && configuredLimitSwitchNormallyClosed(index);
    const bool switchedToVcc = button.limitSwitch && configuredLimitSwitchSwitchedToVcc(index);
    button.limitSwitchUsesPullup = button.limitSwitch ? !switchedToVcc : true;
    button.limitSwitchActiveHigh = button.limitSwitch ? (switchedToVcc != button.normallyClosed) : false;
    button.nativeTouch = isNativeTouchProfileValue(button.profileValue);
    button.touchSupported = button.nativeTouch && isTouchCapablePin(button.pin);
    button.mainControlEnabled = button.nativeTouch && configuredTouchMainControlEnabled(index);
    button.sensitivityPercent = configuredTouchSensitivity(index);
    button.touchRawValue = 0;
    button.touchBaselineValue = 0;
    button.touchPressCandidateCount = 0;
    button.touchReleaseCandidateCount = 0;
    button.lastSampledPressed = false;
    button.stablePressed = false;
    button.holdResetTriggered = false;
    button.pressedSinceAt = 0;
}

InputChannelSnapshot inputSnapshotFor(const PhysicalButtonState& button) {
    InputChannelSnapshot snapshot;
    snapshot.configuredIndex = button.configuredIndex;
    snapshot.pin = button.pin;
    snapshot.profile = button.profileValue;
    snapshot.nativeTouch = button.nativeTouch;
    snapshot.touchSupported = button.touchSupported;
    snapshot.active = button.stablePressed;
    snapshot.sensitivityPercent = button.sensitivityPercent;
    snapshot.rawValue = button.touchRawValue;
    snapshot.baselineValue = button.touchBaselineValue;
    return snapshot;
}

void publishInputSnapshots() {
    if (appState == nullptr) {
        return;
    }
    appState->setInputs(inputSnapshotFor(button1), inputSnapshotFor(button2));
}

bool isBatterySamplingAllowed() {
    if (audioPlayer == nullptr) {
        return true;
    }

    const String audioState = audioPlayer->currentState();
    return audioState != "playing" && audioState != "buffering";
}

bool isPhysicalButtonEnabled(const PhysicalButtonState& button) {
    return button.profileValue != "none" && !sdStorageUsesPin(button.pin);
}

void flashFactoryResetIndicator() {
    writeStatusLedColor(kStatusLedBrightness, 0, 0);
    delay(500);
    writeStatusLed(false);
}

bool isAnyTouchInputPressed() {
    return (button1.touchSupported && button1.stablePressed) || (button2.touchSupported && button2.stablePressed);
}

bool isFactoryResetLedBlinkActive(unsigned long now) {
    return factoryResetLedBlinkUntil != 0 && static_cast<long>(now - factoryResetLedBlinkUntil) < 0;
}

void startFactoryResetLedBlink(unsigned long now, unsigned long durationMs = kFactoryResetLedSuccessWindowMs) {
    factoryResetLedBlinkUntil = now + durationMs;
}

void serviceStatusLedOverrides(unsigned long now) {
    if (isFactoryResetLedBlinkActive(now)) {
        touchStatusLedOverrideActive = false;
        const bool flashOn = ((now / kFactoryResetLedBlinkIntervalMs) % 2UL) == 0;
        writeStatusLedColor(flashOn ? kStatusLedBrightness : 0, 0, 0);
        return;
    }
    if (factoryResetLedBlinkUntil != 0) {
        factoryResetLedBlinkUntil = 0;
        touchStatusLedOverrideActive = false;
        updateStatusLedForNetwork(wifiManager != nullptr && wifiManager->isConnected(), wifiManager != nullptr && wifiManager->isApMode(), now);
        return;
    }
    if (isAnyTouchInputPressed()) {
        touchStatusLedOverrideActive = true;
        writeStatusLedColor(0, kStatusLedBrightness, 0);
        return;
    }
    if (touchStatusLedOverrideActive) {
        touchStatusLedOverrideActive = false;
        updateStatusLedForNetwork(wifiManager != nullptr && wifiManager->isConnected(), wifiManager != nullptr && wifiManager->isApMode(), now);
    }
}

void triggerTouchHoldFactoryReset(PhysicalButtonState& button) {
    if (button.holdResetTriggered) {
        return;
    }

    button.holdResetTriggered = true;
    Serial.printf("[input] %s held on GPIO%u for %lu ms, triggering factory reset\n",
                  button.label,
                  static_cast<unsigned>(button.pin),
                  static_cast<unsigned long>(kTouchFactoryResetHoldMs));
    if (displayManager != nullptr) {
        displayManager->showTemporaryCenterText("Factory Reset", 1500UL);
    }
    if (appState != nullptr) {
        appState->setLastError("Touch hold reset: restoring default settings.");
    }
    factoryResetRequested = true;
    scheduleReboot(kFactoryResetLedSuccessWindowMs + 250UL);
}

void serviceTouchHoldFactoryReset(PhysicalButtonState& button, unsigned long now) {
    if (settings == nullptr || !settings->device.touchHoldFactoryResetEnabled ||
        !button.mainControlEnabled ||
        !button.nativeTouch || !button.touchSupported || !button.stablePressed || button.pressedSinceAt == 0 ||
        rebootRequested || factoryResetRequested || button.holdResetTriggered) {
        return;
    }

    if ((now - button.pressedSinceAt) >= kTouchFactoryResetHoldMs) {
        triggerTouchHoldFactoryReset(button);
    }
}

const char* resetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_UNKNOWN:
            return "unknown";
        case ESP_RST_POWERON:
            return "poweron";
        case ESP_RST_EXT:
            return "external";
        case ESP_RST_SW:
            return "software";
        case ESP_RST_PANIC:
            return "panic";
        case ESP_RST_INT_WDT:
            return "interrupt watchdog";
        case ESP_RST_TASK_WDT:
            return "task watchdog";
        case ESP_RST_WDT:
            return "other watchdog";
        case ESP_RST_DEEPSLEEP:
            return "deepsleep";
        case ESP_RST_BROWNOUT:
            return "brownout";
        case ESP_RST_SDIO:
            return "sdio";
        default:
            return "unhandled";
    }
}

String normalizedAppVersion() {
    return String("v") + APP_VERSION;
}

String readPreferenceStringIfPresent(Preferences& prefs, const char* key) {
    return prefs.isKey(key) ? prefs.getString(key, "") : String("");
}

void removePreferenceIfPresent(Preferences& prefs, const char* key) {
    if (prefs.isKey(key)) {
        prefs.remove(key);
    }
}

bool isPowerCycleResetReason(esp_reset_reason_t reason) {
    return reason == ESP_RST_POWERON || reason == ESP_RST_BROWNOUT;
}

void clearPowerCycleCounter() {
    Preferences prefs;
    if (!prefs.begin(kPowerCycleNamespace, false)) {
        return;
    }
    removePreferenceIfPresent(prefs, kPowerCycleCountKey);
    prefs.end();
}

uint8_t updatePowerCycleCounter(esp_reset_reason_t resetReason) {
    Preferences prefs;
    if (!prefs.begin(kPowerCycleNamespace, false)) {
        return 0;
    }

    uint8_t count = 0;
    if (isPowerCycleResetReason(resetReason)) {
        count = prefs.getUChar(kPowerCycleCountKey, 0);
        if (count < 255) {
            count += 1;
        }
        prefs.putUChar(kPowerCycleCountKey, count);
    } else {
        removePreferenceIfPresent(prefs, kPowerCycleCountKey);
    }

    prefs.end();
    return count;
}

void armPowerCycleCounterClear() {
    powerCycleCounterClearArmed = true;
    powerCycleCounterClearAt = millis() + kPowerCycleCounterClearDelayMs;
}

void maybeClearPowerCycleCounterAfterStableBoot() {
    if (!powerCycleCounterClearArmed || static_cast<long>(millis() - powerCycleCounterClearAt) < 0) {
        return;
    }
    clearPowerCycleCounter();
    powerCycleCounterClearArmed = false;
    Serial.println("[boot-guard] power-cycle counter cleared after stable uptime");
}

