elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
uint8_t effectVolumeForSource(const String& source) {
    if (settings == nullptr) {
        return DefaultConfig::DEFAULT_VOLUME_PERCENT;
    }
    if (source == "effect-startup") return settings->effects.startupVolumePercent;
    if (source == "effect-alarm") return settings->effects.alarmVolumePercent;
    if (source == "effect-notification") return settings->effects.notificationVolumePercent;
    if (source == "effect-ambient") return settings->effects.ambientVolumePercent;
    if (source == "effect-low-battery") return settings->effects.lowBatteryVolumePercent;
    if (source == "effect-shutdown") return settings->effects.shutDownVolumePercent;
    if (source == "effect-update-available") return settings->effects.updateAvailableVolumePercent;
    if (source == "effect-update-success") return settings->effects.updateSuccessVolumePercent;
    return settings->device.savedVolumePercent;
}

void restoreEffectVolumeIfNeeded() {
    if (!runtimeAudio.effectVolumeApplied || audioPlayer == nullptr) {
        return;
    }
    audioPlayer->setVolumePercent(settings != nullptr ? settings->device.savedVolumePercent : DefaultConfig::DEFAULT_VOLUME_PERCENT);
    runtimeAudio.effectVolumeApplied = false;
}

bool playConfiguredEffect(const String& effectRef, const String& label, const String& source, String* errorOut = nullptr) {
    auto setEffectError = [&](const String& message) {
        if (errorOut != nullptr) {
            *errorOut = message;
        }
    };

    if (effectRef.isEmpty()) {
        setEffectError(label + " effect is not configured.");
        return false;
    }
    if (deferredActions == nullptr) {
        setEffectError(label + " effect could not start because deferred audio actions are unavailable.");
        return false;
    }

    StorageTarget effectTarget = StorageTarget::Flash;
    String effectPath;
    if (parseStorageFileReference(effectRef, effectTarget, effectPath)) {
        if (effectTarget == StorageTarget::Sd && !storageMounted(effectTarget)) {
            remountActiveStorageBackend(effectTarget);
        }
        if (!storageMounted(effectTarget)) {
            setEffectError(label + " effect storage is not mounted.");
            return false;
        }
        if (effectTarget != StorageTarget::Sd && !storageExists(effectTarget, effectPath)) {
            setEffectError(label + " effect file is missing: " + effectRef);
            return false;
        }
    }

    if (source.startsWith("effect-") && source != "effect-ambient" && audioPlayer != nullptr) {
        restoreAmbientVolumeIfNeeded();
        audioPlayer->setVolumePercent(effectVolumeForSource(source));
        runtimeAudio.effectVolumeApplied = true;
    }
    String requestError;
    if (playRequest(effectRef, label, "effect", source, requestError, false)) {
        setEffectError("");
        return true;
    }
    restoreEffectVolumeIfNeeded();
    setEffectError(requestError.isEmpty() ? label + " effect could not start." : requestError);
    return false;
}

bool tryOverlayEffectReference(const String& effectRef, uint8_t duckPercent = 35, uint8_t overlayPercent = 100, bool allowAmbientSource = false) {
    if (effectRef.isEmpty() || audioPlayer == nullptr || appState == nullptr) {
        return false;
    }
    StorageTarget target = StorageTarget::Flash;
    String path;
    if (!parseStorageFileReference(effectRef, target, path)) {
        return false;
    }
    const AppStateSnapshot snapshot = appState->snapshot();
    if (snapshot.playback.state != "playing" ||
        (snapshot.playback.source.startsWith("effect-") && (!allowAmbientSource || snapshot.playback.source != "effect-ambient"))) {
        return false;
    }
    return audioPlayer->playStorageOverlay(target, path, duckPercent, overlayPercent);
}

bool tryOverlayConfiguredEffect(const String& effectRef, uint8_t duckPercent = 35, uint8_t overlayPercent = 100) {
    return tryOverlayEffectReference(effectRef, duckPercent, overlayPercent, false);
}

bool playConfiguredEffectSource(const String& source, const String& label, String* errorOut = nullptr) {
    return playConfiguredEffect(effectFileForSource(source), label, source, errorOut);
}

uint8_t ambientPlaybackVolumePercent() {
    if (settings == nullptr) {
        return 20;
    }
    return effectVolumeForSource("effect-ambient");
}

void restoreAmbientVolumeIfNeeded() {
    if (!runtimeAudio.ambientVolumeApplied || audioPlayer == nullptr) {
        return;
    }
    audioPlayer->setVolumePercent(settings != nullptr ? settings->device.savedVolumePercent : runtimeAudio.ambientPreviousVolume);
    runtimeAudio.ambientVolumeApplied = false;
}

void startAmbientIfEligible(const AppStateSnapshot& snapshot) {
    if (settings == nullptr || audioPlayer == nullptr || runtimeAudio.alarmActive || runtimeAudio.restartPending ||
        settings->effects.ambientSoundFile.isEmpty() || snapshot.playback.state != "idle") {
        return;
    }
    if (runtimeAudio.ambientEligibleAt == 0 || static_cast<long>(millis() - runtimeAudio.ambientEligibleAt) < 0) {
        return;
    }
    runtimeAudio.ambientPreviousVolume = settings->device.savedVolumePercent;
    audioPlayer->setVolumePercent(ambientPlaybackVolumePercent());
    runtimeAudio.ambientVolumeApplied = true;
    if (!playConfiguredEffectSource("effect-ambient", "Ambient Sound")) {
        restoreAmbientVolumeIfNeeded();
        runtimeAudio.ambientEligibleAt = millis() + kAmbientResumeDelayMs;
    }
}

void scheduleAmbientResume(unsigned long delayMs = 0UL) {
    runtimeAudio.ambientEligibleAt = millis() + delayMs;
}

void applyWebUiLockNow() {
    if (webServer != nullptr) {
        webServer->setWebUiLocked(true);
    }
    if (appState != nullptr) {
        appState->setLastError("Web UI locked. Unlock it via MQTT command <baseTopic>/cmd/web_ui with payload unlock.");
    }
    if (mqttManager != nullptr) {
        mqttManager->publishState();
    }
}

void requestWebUiLockSequence() {
    runtimeAudio.webUiLockPending = true;
    runtimeAudio.pendingCommandAfterNotification = false;
    runtimeAudio.alarmActive = false;
    restoreAmbientVolumeIfNeeded();

    if (audioPlayer != nullptr) {
        audioPlayer->stop();
    }

