elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (!playConfiguredEffectSource("effect-shutdown", "Shutting Down")) {
        runtimeAudio.webUiLockPending = false;
        applyWebUiLockNow();
    }
}

void requestRestartSequence(const String& reason, bool factoryResetAfterRestart) {
    runtimeAudio.restartPending = true;
    runtimeAudio.restartFactoryReset = factoryResetAfterRestart;
    runtimeAudio.restartReason = reason;
    runtimeAudio.restartForcePending = true;
    runtimeAudio.restartForceAt = millis() + kRestartEffectForceDelayMs;
    runtimeAudio.pendingCommandAfterNotification = false;
    runtimeAudio.alarmActive = false;
    restoreAmbientVolumeIfNeeded();

    if (audioPlayer != nullptr) {
        audioPlayer->stop();
    }

    const bool playedUpdateSuccess = reason == "ota" && playConfiguredEffectSource("effect-update-success", "Update Success");
    if (!playedUpdateSuccess && !playConfiguredEffectSource("effect-shutdown", "Restarting")) {
        if (factoryResetAfterRestart) {
            factoryResetRequested = true;
        }
        scheduleReboot(250);
    }
}

void handleOtaRestartRequest(const String& reason) {
    requestRestartSequence(reason, false);
}

uint8_t estimateBatteryPercent(float voltage) {
    const float normalized = (voltage - kBatteryPercentEmptyVoltage) / (kBatteryPercentFullVoltage - kBatteryPercentEmptyVoltage);
    const float clamped = normalized < 0.0f ? 0.0f : (normalized > 1.0f ? 1.0f : normalized);
    return static_cast<uint8_t>((clamped * 100.0f) + 0.5f);
}

String normalizedButtonAction(String action, const char* fallback) {
    action.trim();
    action.toLowerCase();
    action.replace('-', '_');
    action.replace(' ', '_');

    if (action == "none" || action == "previous" || action == "next" || action == "play_pause" ||
        action == "replay_current" || action == "stop" || action == "volume_up" || action == "volume_down" ||
        action == "ha_previous" || action == "ha_next") {
        return action;
    }

    return String(fallback);
}

String buttonActionFor(const PhysicalButtonState& button) {
    if (settings == nullptr) {
        return button.controlSlot == 0 ? String(DefaultConfig::BUTTON1_DEFAULT_ACTION) : String(DefaultConfig::BUTTON2_DEFAULT_ACTION);
    }

    return button.controlSlot == 0
        ? normalizedButtonAction(settings->device.button1Action, DefaultConfig::BUTTON1_DEFAULT_ACTION)
        : normalizedButtonAction(settings->device.button2Action, DefaultConfig::BUTTON2_DEFAULT_ACTION);
}

int resolveMainControlInputIndex() {
    for (size_t index = 0; index < kMaxPeripheralInputProfiles; ++index) {
        const String profile = peripheralInputProfileFromUi(index);
        if (isNativeTouchProfileValue(profile) && configuredTouchMainControlEnabled(index)) {
            return static_cast<int>(index);
        }
    }
    return -1;
}

int resolveSecondaryInputIndex(int excludedIndex, int fallbackIndex) {
    for (size_t index = 0; index < kMaxPeripheralInputProfiles; ++index) {
        if (static_cast<int>(index) == excludedIndex) {
            continue;
        }
        if (peripheralInputProfileFromUi(index) != "none") {
            return static_cast<int>(index);
        }
    }
    return fallbackIndex;
}

String buttonActionDisplayLabel(const String& action) {
    if (action == "none") {
        return "Disabled";
    }
    if (action == "previous") {
        return "Previous";
    }
    if (action == "next") {
        return "Next";
    }
    if (action == "play_pause") {
        return "Play/Pause";
    }
    if (action == "replay_current") {
        return "Replay";
    }
    if (action == "stop") {
        return "Stop";
    }
    if (action == "volume_up") {
        return "Volume +";
    }
    if (action == "volume_down") {
        return "Volume -";
    }
    if (action == "ha_previous") {
        return "HA Prev";
    }
    if (action == "ha_next") {
        return "HA Next";
    }
    return action;
}

String buttonOverlayText(const String& action) {
    if ((action == "volume_up" || action == "volume_down") && settings != nullptr) {
        String label = "Volume ";
        label += settings->device.savedVolumePercent;
        label += "%";
        return label;
    }

    return buttonActionDisplayLabel(action);
}

void showS3ButtonActionOnDisplay(const String& action) {
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    if (displayManager != nullptr) {
        displayManager->showTemporaryCenterText(buttonOverlayText(action));
    }
#else
    (void)action;
#endif
}

void initializeButtons() {
    const unsigned long now = millis();
    const uint8_t defaultButton1Pin = DefaultConfig::BUTTON1_PIN;
    const uint8_t defaultButton2Pin = DefaultConfig::BUTTON2_PIN;
    button1.controlSlot = 0;
    button2.controlSlot = 1;
    const int mainControlIndex = resolveMainControlInputIndex();
    const int primaryIndex = mainControlIndex >= 0 ? mainControlIndex : 0;
    const int secondaryIndex = resolveSecondaryInputIndex(primaryIndex, 1);
    applyButtonProfileConfig(button1, static_cast<size_t>(primaryIndex), defaultButton1Pin);
    applyButtonProfileConfig(button2, static_cast<size_t>(secondaryIndex), defaultButton2Pin);

    if (isPhysicalButtonEnabled(button1)) {
        if (button1.touchSupported) {
            button1.touchRawValue = touchRead(button1.pin);
            button1.touchBaselineValue = button1.touchRawValue;
            button1.lastSampledPressed = false;
        } else if (button1.limitSwitch) {
            pinMode(button1.pin, button1.limitSwitchUsesPullup ? INPUT_PULLUP : INPUT_PULLDOWN);
            button1.lastSampledPressed = false;
        } else {
            pinMode(button1.pin, INPUT_PULLDOWN);
            button1.lastSampledPressed = digitalRead(button1.pin) == HIGH;
        }
    } else {
        pinMode(button1.pin, INPUT);
        button1.lastSampledPressed = false;
    }
    button1.stablePressed = button1.lastSampledPressed;
    button1.holdResetTriggered = false;
    button1.pressedSinceAt = button1.stablePressed ? now : 0;
    button1.lastTransitionAt = now;

    if (isPhysicalButtonEnabled(button2)) {
        if (button2.touchSupported) {
            button2.touchRawValue = touchRead(button2.pin);
            button2.touchBaselineValue = button2.touchRawValue;
            button2.lastSampledPressed = false;
        } else if (button2.limitSwitch) {
            pinMode(button2.pin, button2.limitSwitchUsesPullup ? INPUT_PULLUP : INPUT_PULLDOWN);
            button2.lastSampledPressed = false;
        } else {
            pinMode(button2.pin, INPUT_PULLDOWN);
            button2.lastSampledPressed = digitalRead(button2.pin) == HIGH;
        }
    } else {
        pinMode(button2.pin, INPUT);
        button2.lastSampledPressed = false;
    }
    button2.stablePressed = button2.lastSampledPressed;
    button2.holdResetTriggered = false;
    button2.pressedSinceAt = button2.stablePressed ? now : 0;
    button2.lastTransitionAt = now;
    publishInputSnapshots();
}

void rememberPlaybackSelection(const String& url, const String& label, const String& type, const String& source) {
    const String normalizedUrl = canonicalPlaybackReference(url);
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    const bool storageReference = parseStorageFileReference(normalizedUrl, storageTarget, storagePath);
    const String normalizedLabel = storageReference
        ? PlaybackText::normalizeTitle(label, storagePath)
        : PlaybackText::normalizeTitle(label, normalizedUrl);

    if (normalizedUrl.isEmpty()) {
        return;
    }

