elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (playbackHistoryIndex >= 0 && playbackHistoryIndex < static_cast<int>(playbackHistoryCount)) {
        PlaybackHistoryEntry& current = playbackHistory[playbackHistoryIndex];
        if (current.url == normalizedUrl && current.type == type) {
            current.label = normalizedLabel;
            current.source = source;
            return;
        }
    }

    if (playbackHistoryIndex >= 0 && playbackHistoryIndex < static_cast<int>(playbackHistoryCount - 1)) {
        playbackHistoryCount = static_cast<size_t>(playbackHistoryIndex + 1);
    }

    if (playbackHistoryCount > 0) {
        PlaybackHistoryEntry& last = playbackHistory[playbackHistoryCount - 1];
        if (last.url == normalizedUrl && last.type == type) {
            last.label = normalizedLabel;
            last.source = source;
            playbackHistoryIndex = static_cast<int>(playbackHistoryCount - 1);
            return;
        }
    }

    if (playbackHistoryCount == kPlaybackHistoryLimit) {
        for (size_t index = 1; index < playbackHistoryCount; ++index) {
            playbackHistory[index - 1] = playbackHistory[index];
        }
        playbackHistoryCount -= 1;
    }

    playbackHistory[playbackHistoryCount] = {normalizedUrl, normalizedLabel, type, source};
    playbackHistoryCount += 1;
    playbackHistoryIndex = static_cast<int>(playbackHistoryCount - 1);
}

bool replayPlaybackEntry(const PlaybackHistoryEntry& entry, bool addToHistory) {
    if (entry.url.isEmpty()) {
        return false;
    }

    String error;
    return playRequest(entry.url, entry.label, entry.type, entry.source, error, addToHistory);
}

void clearPreviewResumeState() {
    runtimeAudio.previewResumePending = false;
    runtimeAudio.previewResumeVolume = 0;
    runtimeAudio.previewResumeUrl = "";
    runtimeAudio.previewResumeLabel = "";
    runtimeAudio.previewResumeType = "";
    runtimeAudio.previewResumeSource = "";
    runtimeAudio.previewActiveSource = "";
}

bool queuePreviewResume(const AppStateSnapshot& snapshot, const String& previewSource) {
    const bool resumableAmbient = snapshot.playback.source == "effect-ambient";
    if ((snapshot.playback.state != "playing" && snapshot.playback.state != "buffering") ||
        snapshot.playback.url.isEmpty() ||
        (snapshot.playback.source.startsWith("effect-") && !resumableAmbient)) {
        clearPreviewResumeState();
        return false;
    }

    runtimeAudio.previewResumePending = true;
    runtimeAudio.previewResumeVolume = snapshot.playback.volumePercent;
    runtimeAudio.previewResumeUrl = snapshot.playback.url;
    runtimeAudio.previewResumeLabel = snapshot.playback.title;
    runtimeAudio.previewResumeType = snapshot.playback.type;
    runtimeAudio.previewResumeSource = snapshot.playback.source;
    runtimeAudio.previewActiveSource = previewSource;
    return true;
}

bool resumeQueuedPreviewPlayback() {
    if (!runtimeAudio.previewResumePending || runtimeAudio.previewResumeUrl.isEmpty()) {
        clearPreviewResumeState();
        return false;
    }

    if (deferredActions != nullptr && deferredActions->playPending) {
        return false;
    }

    const String resumeUrl = runtimeAudio.previewResumeUrl;
    const String resumeLabel = runtimeAudio.previewResumeLabel;
    const String resumeType = runtimeAudio.previewResumeType;
    const String resumeSource = runtimeAudio.previewResumeSource;

    // Keep ambient auto-start from winning the same-loop race before the
    // queued stream/media resume is processed in the next deferred-actions pass.
    scheduleAmbientResume(kAmbientResumeDelayMs);

    String error;
    const bool queued = playRequest(resumeUrl, resumeLabel, resumeType, resumeSource, error, false);
    if (!queued && !error.isEmpty()) {
        Serial.printf("[audio] preview resume skipped: %s\n", error.c_str());
    }
    return queued;
}

bool replayCurrentPlaybackSelection(bool addToHistory) {
    if (playbackHistoryIndex >= 0 && playbackHistoryIndex < static_cast<int>(playbackHistoryCount)) {
        return replayPlaybackEntry(playbackHistory[playbackHistoryIndex], addToHistory);
    }

    if (appState == nullptr) {
        return false;
    }

    const AppStateSnapshot snapshot = appState->snapshot();
    if (snapshot.playback.url.isEmpty()) {
        return false;
    }

    String error;
    return playRequest(snapshot.playback.url, snapshot.playback.title, snapshot.playback.type, snapshot.playback.source, error, addToHistory);
}

bool stepPlaybackHistory(int direction) {
    if (playbackHistoryCount == 0 || direction == 0) {
        return false;
    }

    int nextIndex = playbackHistoryIndex;
    if (nextIndex < 0 || nextIndex >= static_cast<int>(playbackHistoryCount)) {
        nextIndex = direction > 0 ? 0 : static_cast<int>(playbackHistoryCount - 1);
    } else {
        nextIndex = (nextIndex + direction + static_cast<int>(playbackHistoryCount)) % static_cast<int>(playbackHistoryCount);
    }

    playbackHistoryIndex = nextIndex;
    return replayPlaybackEntry(playbackHistory[nextIndex], false);
}

void applyVolumePercent(uint8_t volumePercent) {
    if (settings == nullptr || audioPlayer == nullptr || soundEffects == nullptr || deferredActions == nullptr) {
        return;
    }

    settings->device.savedVolumePercent = volumePercent;
    audioPlayer->setVolumePercent(volumePercent);
    soundEffects->setVolumePercent(volumePercent);
    deferredActions->pendingVolume = volumePercent;
    deferredActions->volumePending = false;
    deferredActions->volumeSavePending = true;
    deferredActions->volumeSaveAt = millis() + kVolumePersistDelayMs;
    if (mqttManager != nullptr) {
        mqttManager->publishState();
    }
}

void changeVolumeBy(int delta) {
    if (settings == nullptr) {
        return;
    }

    int nextVolume = static_cast<int>(settings->device.savedVolumePercent) + delta;
    if (nextVolume < 0) {
        nextVolume = 0;
    }
    if (nextVolume > 100) {
        nextVolume = 100;
    }

    applyVolumePercent(static_cast<uint8_t>(nextVolume));
}

bool executeButtonAction(const PhysicalButtonState& button, const String& action) {
    if (action == "none") {
        return false;
    }

    if (displayManager != nullptr) {
        displayManager->markActivity();
    }

    if (action == "previous") {
        return stepPlaybackHistory(-1);
    }
    if (action == "next") {
        return stepPlaybackHistory(1);
    }
    if (action == "play_pause") {
        const AppStateSnapshot snapshot = appState->snapshot();
        if (snapshot.playback.state == "playing" || snapshot.playback.state == "buffering") {
            audioPlayer->stop();
            if (mqttManager != nullptr) {
                mqttManager->publishState();
            }
            return true;
        }
        return replayCurrentPlaybackSelection(false);
    }
    if (action == "replay_current") {
        return replayCurrentPlaybackSelection(false);
    }
    if (action == "stop") {
        audioPlayer->stop();
        if (mqttManager != nullptr) {
            mqttManager->publishState();
        }
        return true;
    }
    if (action == "volume_up") {
        changeVolumeBy(DefaultConfig::BUTTON_VOLUME_STEP_PERCENT);
        return true;
    }
    if (action == "volume_down") {
        changeVolumeBy(-static_cast<int>(DefaultConfig::BUTTON_VOLUME_STEP_PERCENT));
        return true;
    }
    if (action == "ha_previous" || action == "ha_next") {
        if (mqttManager == nullptr) {
            return false;
        }
        return mqttManager->publishButtonActionEvent(button.label, button.pin, action == "ha_previous" ? "previous" : "next");
    }

