elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    return false;
}

bool sampleButtonPressed(PhysicalButtonState& button) {
    if (!button.touchSupported) {
        button.touchRawValue = 0;
        button.touchBaselineValue = 0;
        button.touchPressCandidateCount = 0;
        button.touchReleaseCandidateCount = 0;
        const bool pinHigh = digitalRead(button.pin) == HIGH;
        if (!button.limitSwitch) {
            return pinHigh;
        }
        return pinHigh == button.limitSwitchActiveHigh;
    }

    const uint16_t rawValue = touchRead(button.pin);
    button.touchRawValue = rawValue;
    if (button.touchBaselineValue == 0 && rawValue > 0) {
        button.touchBaselineValue = rawValue;
    }

    const uint16_t baseline = button.touchBaselineValue;
    const uint16_t requiredDeltaBasisPoints = static_cast<uint16_t>(200U - ((static_cast<uint32_t>(button.sensitivityPercent) * 150U) / 100U));
    const uint16_t requiredDelta = max<uint16_t>(32U, static_cast<uint16_t>((static_cast<uint32_t>(baseline) * requiredDeltaBasisPoints) / 10000U));
    const uint16_t absoluteDelta = rawValue > baseline ? static_cast<uint16_t>(rawValue - baseline) : static_cast<uint16_t>(baseline - rawValue);
    const bool candidatePressed = baseline > 0 && rawValue > 0 && absoluteDelta >= requiredDelta;

    if (!button.stablePressed && rawValue > 0) {
        const uint16_t settlingDelta = max<uint16_t>(6U, static_cast<uint16_t>(requiredDelta / 4U));
        if (button.touchBaselineValue == 0) {
            button.touchBaselineValue = rawValue;
        } else if (!candidatePressed && absoluteDelta <= settlingDelta) {
            button.touchBaselineValue = static_cast<uint16_t>((static_cast<uint32_t>(button.touchBaselineValue) * 31UL + rawValue + 16UL) / 32UL);
        }
    }

    if (candidatePressed) {
        if (button.touchPressCandidateCount < 255) {
            button.touchPressCandidateCount += 1;
        }
        button.touchReleaseCandidateCount = 0;
    } else {
        button.touchPressCandidateCount = 0;
        if (button.touchReleaseCandidateCount < 255) {
            button.touchReleaseCandidateCount += 1;
        }
    }

    if (button.stablePressed) {
        return button.touchReleaseCandidateCount < kTouchReleaseCandidateSamples;
    }
    return button.touchPressCandidateCount >= kTouchPressCandidateSamples;
}

void pollPhysicalButton(PhysicalButtonState& button) {
    if (!isPhysicalButtonEnabled(button)) {
        button.touchRawValue = 0;
        button.touchBaselineValue = 0;
        button.touchPressCandidateCount = 0;
        button.touchReleaseCandidateCount = 0;
        button.lastSampledPressed = false;
        button.stablePressed = false;
        button.holdResetTriggered = false;
        button.pressedSinceAt = 0;
        return;
    }

    const bool pressed = sampleButtonPressed(button);
    const unsigned long now = millis();

    if (pressed != button.lastSampledPressed) {
        button.lastSampledPressed = pressed;
        button.lastTransitionAt = now;
    }

    const unsigned long debounceMs = button.touchSupported ? kTouchDebounceMs : kButtonDebounceMs;
    if ((now - button.lastTransitionAt) < debounceMs || pressed == button.stablePressed) {
        serviceTouchHoldFactoryReset(button, now);
        return;
    }

    button.stablePressed = pressed;
    if (!button.stablePressed) {
        button.pressedSinceAt = 0;
        button.holdResetTriggered = false;
        return;
    }

    button.pressedSinceAt = now;
    button.holdResetTriggered = false;

    const String action = buttonActionFor(button);
    const bool handled = executeButtonAction(button, action);
    if (handled || action == "none") {
        showS3ButtonActionOnDisplay(action);
    }
    Serial.printf("[input] %s on GPIO%u mode=%s action=%s handled=%s\n",
                  button.label,
                  static_cast<unsigned>(button.pin),
                  button.touchSupported ? "touch" : (button.limitSwitch ? (button.normallyClosed ? "limit-nc" : "limit-no") : "gpio"),
                  action.c_str(),
                  handled ? "yes" : "no");
}

void pollPhysicalButtons() {
    pollPhysicalButton(button1);
    pollPhysicalButton(button2);
    publishInputSnapshots();
}

void enterLowBatteryDeepSleep(uint8_t batteryPercent, float voltage, const char* reason) {
    if (settings == nullptr) {
        return;
    }

    const uint16_t wakeIntervalMinutes = settings->device.lowBatteryWakeIntervalMinutes;
    Serial.printf("[power] entering deep sleep reason=%s battery=%u%% voltage=%.3f wake_interval_min=%u\n",
                  reason,
                  static_cast<unsigned>(batteryPercent),
                  voltage,
                  static_cast<unsigned>(wakeIntervalMinutes));
    Serial.flush();

    if (audioPlayer != nullptr) {
        audioPlayer->stop();
    }
    if (displayManager != nullptr) {
        displayManager->powerOff();
    }

    delay(100);
    esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    if (wakeIntervalMinutes > 0) {
        const uint64_t wakeIntervalUs = static_cast<uint64_t>(wakeIntervalMinutes) * 60ULL * 1000000ULL;
        esp_sleep_enable_timer_wakeup(wakeIntervalUs);
    }

    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_OFF);
    delay(100);
    esp_deep_sleep_start();
}

void handleLowBatterySleepPolicy(const AppStateSnapshot& snapshot) {
    if (settings == nullptr || snapshot.ota.busy || !settings->device.lowBatterySleepEnabled) {
        if (settings == nullptr || !settings->device.lowBatterySleepEnabled) {
            wokeFromDeepSleep = false;
            lowBatteryWakeStartedAt = 0;
        }
        return;
    }

    const uint8_t batteryPercent = estimateBatteryPercent(snapshot.battery.voltage);
    const uint8_t thresholdPercent = settings->device.lowBatterySleepThresholdPercent;
    if (batteryPercent > thresholdPercent) {
        wokeFromDeepSleep = false;
        lowBatteryWakeStartedAt = 0;
        return;
    }

    if (wokeFromDeepSleep) {
        if (lowBatteryWakeStartedAt == 0) {
            lowBatteryWakeStartedAt = millis();
            Serial.printf("[power] low-battery wake window started battery=%u%% threshold=%u%%\n",
                          static_cast<unsigned>(batteryPercent),
                          static_cast<unsigned>(thresholdPercent));
        }
        if (millis() - lowBatteryWakeStartedAt < kLowBatteryWakeWindowMs) {
            return;
        }
        enterLowBatteryDeepSleep(batteryPercent, snapshot.battery.voltage, "wake window elapsed while battery still low");
        return;
    }

    enterLowBatteryDeepSleep(batteryPercent, snapshot.battery.voltage, "battery threshold reached");
}

