elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
void publishOtaStateIfNeeded(const AppStateSnapshot& snapshot) {
    if (mqttManager == nullptr || !mqttManager->isConnected()) {
        return;
    }

    const String otaSignature = String(snapshot.ota.busy ? '1' : '0') + "|" + snapshot.ota.latestVersion + "|" +
        snapshot.ota.lastResult + "|" + snapshot.ota.lastError + "|" + snapshot.ota.phase + "|" + snapshot.ota.progressPercent;
    if (otaSignature == lastPublishedOtaSignature) {
        return;
    }

    const unsigned long now = millis();
    if ((now - lastOtaMqttPublishAt) < 500UL && snapshot.ota.busy) {
        return;
    }

    lastPublishedOtaSignature = otaSignature;
    lastOtaMqttPublishAt = now;
    mqttManager->publishState();
}

void pumpOtaDisplayProgress() {
    if (appState == nullptr || displayManager == nullptr) {
        return;
    }
    const AppStateSnapshot snapshot = appState->snapshot();
    displayManager->loop(snapshot);
    publishOtaStateIfNeeded(snapshot);
}

bool initializeRuntimeObjects() {
    if (appState == nullptr) {
        appState = allocatePreferPsram<AppState>();
    }
    if (settingsManager == nullptr) {
        settingsManager = allocatePreferPsram<SettingsManager>();
    }
    if (settings == nullptr) {
        settings = allocatePreferPsram<SettingsBundle>();
    }
    if (wifiManager == nullptr) {
        wifiManager = allocatePreferPsram<WiFiManager>();
    }
    if (batteryMonitor == nullptr) {
        batteryMonitor = allocatePreferPsram<BatteryMonitor>();
    }
    if (displayManager == nullptr) {
        displayManager = allocatePreferPsram<DisplayManager>();
    }
    if (audioPlayer == nullptr) {
        audioPlayer = allocatePreferPsram<AudioPlayerType>();
    }
    if (otaManager == nullptr) {
        otaManager = allocatePreferPsram<OtaManager>();
    }
    if (mqttManager == nullptr) {
        mqttManager = allocatePreferPsram<MqttManager>();
    }
    if (webServer == nullptr) {
        webServer = allocatePreferPsram<WebServerManager>();
    }
    if (soundEffects == nullptr) {
        soundEffects = allocatePreferPsram<SoundEffectsManager>();
    }
    if (deferredActions == nullptr) {
        deferredActions = allocatePreferPsram<DeferredActions>();
    }

    return appState != nullptr && settingsManager != nullptr && settings != nullptr && wifiManager != nullptr &&
           batteryMonitor != nullptr && displayManager != nullptr && audioPlayer != nullptr && otaManager != nullptr &&
           mqttManager != nullptr && webServer != nullptr && soundEffects != nullptr && deferredActions != nullptr;
}

void applyRuntimeSettings() {
    applyStorageSettings(*settings);
    initializeButtons();
    motorController.applySettings(*settings);
    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, settings->usingSavedSettings);
    applyStatusLedPin(settings->device.statusLedPin);
    applyWapeTriggerPin(settings->oled.displayType == "wape" ? settings->oled.wapeTriggerPin : 0);
    wifiManager->applySettings(*settings);
    batteryMonitor->applySettings(settings->battery, settings->battery.adcPin);
    displayManager->applySettings(settings->oled);
    if (!settings->audio.enabled) {
        if (activeAudioOutputEnabled) {
            audioPlayer->disableOutput();
            activeAudioOutputEnabled = false;
        }
    } else if (!activeAudioOutputEnabled || settings->audio.bclkPin != activeI2sBclkPin || settings->audio.wsPin != activeI2sWsPin || settings->audio.doutPin != activeI2sDoutPin) {
        if (audioPlayer->reconfigureOutputPins(settings->audio.bclkPin, settings->audio.wsPin, settings->audio.doutPin)) {
            activeI2sBclkPin = settings->audio.bclkPin;
            activeI2sWsPin = settings->audio.wsPin;
            activeI2sDoutPin = settings->audio.doutPin;
            activeAudioOutputEnabled = true;
        }
    }
#if APP_AUDIO_DIAGNOSTIC_TEST
    audioPlayer->setDirectLibraryVolume(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME);
#else
    const AppStateSnapshot snapshot = appState->snapshot();
    if (snapshot.playback.source == "effect-ambient") {
        runtimeAudio.ambientPreviousVolume = settings->device.savedVolumePercent;
        audioPlayer->setVolumePercent(ambientPlaybackVolumePercent());
        runtimeAudio.ambientVolumeApplied = true;
        runtimeAudio.effectVolumeApplied = false;
    } else if (snapshot.playback.source.startsWith("effect-")) {
        audioPlayer->setVolumePercent(effectVolumeForSource(snapshot.playback.source));
        runtimeAudio.effectVolumeApplied = true;
        runtimeAudio.ambientVolumeApplied = false;
    } else {
        audioPlayer->setVolumePercent(settings->device.savedVolumePercent);
        runtimeAudio.ambientVolumeApplied = false;
        runtimeAudio.effectVolumeApplied = false;
    }
#endif
    soundEffects->applySettings(*settings);
    mqttManager->applySettings(*settings);
    otaManager->applySettings(*settings);
    runtimeAudio.ambientEligibleAt = millis() + kAmbientResumeDelayMs;
    runtimeAudio.updateAvailableHandled = false;
    sampleSystemMetrics();

    // Repaint the current status immediately on the newly selected LED pin so
    // the pin change is visible right after Save Device Settings.
    updateStatusLedForNetwork(wifiManager->isConnected(), wifiManager->isApMode());
}

bool saveSettingsFromJson(JsonVariantConst root, String& error) {
    SettingsBundle updated = *settings;
    if (!settingsManager->updateFromJson(updated, root, error)) {
        return false;
    }
    updated.usingSavedSettings = true;
    *settings = updated;
    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, true);
    deferredActions->pendingSettings = updated;
    deferredActions->settingsApplyPending = true;
    return true;
}

bool playRequest(const String& url, const String& label, const String& type, const String& source, String& error, bool addToHistory) {
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    const bool storageReference = parseStorageFileReference(url, storageTarget, storagePath);
    String normalizedUrl;
    if (!storageReference) {
        normalizedUrl = PlaybackText::normalizeUrl(url);
        if (normalizedUrl.isEmpty()) {
            error = "URL is required";
            return false;
        }
    }
#if APP_AUDIO_DIAGNOSTIC_TEST
    if (source != "diagnostic-test") {
        error = "Diagnostic audio test build only plays the configured MAX98357A test stream.";
        return false;
    }
#endif
#ifdef APP_DISABLE_AUDIO
    error = "Audio disabled in diagnostic build";
    return false;
#endif
    deferredActions->playFromStorage = storageReference;
    deferredActions->playStorageTarget = storageTarget;
    deferredActions->playStoragePath = storagePath;
    deferredActions->playUrl = storageReference ? String(url) : normalizedUrl;
    deferredActions->playLabel = storageReference
        ? PlaybackText::normalizeTitle(label, storagePath)
        : PlaybackText::normalizeTitle(label, normalizedUrl);
    deferredActions->playType = type;
    deferredActions->playAddToHistory = addToHistory;
    if (!source.isEmpty()) {
        deferredActions->playSource = source;
    } else {
        deferredActions->playSource = type == "tts" ? "home-assistant" : "manual";
    }
    deferredActions->playPending = true;
    deferredActions->stopPending = false;
    return true;
}

String playbackStartFailureMessage(const DeferredActions& actions) {
    if (actions.playLabel.length() > 0) {
        return String("Failed to start ") + actions.playLabel + ". Check that the selected audio file exists and is playable.";
    }
    if (actions.playFromStorage && actions.playStoragePath.length() > 0) {
        return String("Failed to start ") + actions.playStoragePath + ". Check that the selected audio file exists and is playable.";
    }
    if (actions.playUrl.length() > 0) {
        return String("Failed to start ") + actions.playUrl + ". Check that the selected audio file exists and is playable.";
    }
    return "Failed to start playback. Check that the selected audio file exists and is playable.";
}

void stopAlarmPlayback() {
    runtimeAudio.alarmActive = false;
    if (audioPlayer != nullptr && appState != nullptr) {
        const AppStateSnapshot snapshot = appState->snapshot();
        if (snapshot.playback.source == "effect-alarm") {
            audioPlayer->stop();
        }
    }
    scheduleAmbientResume();
}

