elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
void startAlarmPlayback() {
    runtimeAudio.alarmActive = true;
    restoreAmbientVolumeIfNeeded();
    if (audioPlayer != nullptr) {
        audioPlayer->stop();
    }
    if (!playConfiguredEffectSource("effect-alarm", "Alarm")) {
        runtimeAudio.alarmActive = false;
    }
}

void executePlaybackCommand(const PlaybackCommand& command);

bool payloadEnablesSwitch(const String& value, bool& enabled) {
    if (value.isEmpty()) {
        return false;
    }

    String normalized = value;
    normalized.trim();
    normalized.toLowerCase();

    if (normalized == "on" || normalized == "true" || normalized == "1" || normalized == "enable" || normalized == "enabled") {
        enabled = true;
        return true;
    }

    if (normalized == "off" || normalized == "false" || normalized == "0" || normalized == "disable" || normalized == "disabled") {
        enabled = false;
        return true;
    }

    return false;
}

uint32_t clampPersistedMotorDuration(uint32_t durationMs) {
    if (durationMs < 100U) {
        return 5000U;
    }
    return durationMs > 600000U ? 600000U : durationMs;
}

bool updateMotorRuntimeDurationSetting(int8_t channelIndex, bool forward, uint32_t durationMs, String& error) {
    if (settings == nullptr || settingsManager == nullptr || mqttManager == nullptr) {
        error = "Motor settings are unavailable.";
        return false;
    }
    if (channelIndex < 0 || channelIndex > 1) {
        error = "Unknown motor channel.";
        return false;
    }

    JsonDocument document;
    deserializeJson(document, settings->ui.motorRuntimeConfig.isEmpty() ? String("{}") : settings->ui.motorRuntimeConfig);
    const char* channelKey = channelIndex == 0 ? "a" : "b";
    const char* directionKey = forward ? "forward" : "backward";
    JsonObject channel = document[channelKey].to<JsonObject>();
    JsonObject direction = channel[directionKey].to<JsonObject>();
    direction["durationMs"] = clampPersistedMotorDuration(durationMs);

    String serialized;
    serializeJson(document.as<JsonObjectConst>(), serialized);
    settings->ui.motorRuntimeConfig = serialized;
    settingsManager->save(*settings);
    mqttManager->applySettings(*settings);
    error = "";
    return true;
}

void publishMotorStateIfNeeded() {
    if (mqttManager == nullptr || !mqttManager->isConnected()) {
        return;
    }

    const uint32_t currentVersion = motorController.stateVersion();
    if (currentVersion == lastPublishedMotorStateVersion) {
        return;
    }

    lastPublishedMotorStateVersion = currentVersion;
    mqttManager->publishState();
}

void handleMqttCommand(const PlaybackCommand& command) {
    if (!command.skipNotificationCue &&
        !settings->effects.notificationFile.isEmpty() &&
        (command.action == "play" || command.action == "tts" || command.action == "alarm_start" || command.action == "ota_install" ||
         command.action == "ota_install_latest" || command.action == "ota_install_selected")) {
        runtimeAudio.pendingCommand = command;
        runtimeAudio.pendingCommand.skipNotificationCue = true;
        runtimeAudio.pendingCommandAfterNotification = playConfiguredEffectSource("effect-notification", "MQTT Notification");
        if (runtimeAudio.pendingCommandAfterNotification) {
            return;
        }
    }
    executePlaybackCommand(command);
}

void executePlaybackCommand(const PlaybackCommand& command) {
    if (command.action == "ota_check") {
        String error;
        if (otaManager != nullptr && otaManager->triggerReleaseRefresh(error)) {
            appState->setLastError("");
        } else {
            const String message = error.isEmpty() ? String("OTA release refresh request was rejected.") : error;
            if (otaManager != nullptr) {
                otaManager->reportError(message);
            }
            appState->setLastError(message);
        }
        mqttManager->publishState();
    } else if (command.action == "ota_select_version") {
        String error;
        if (otaManager != nullptr && otaManager->selectReleaseOption(command.label, error)) {
            appState->setLastError("");
        } else {
            const String message = error.isEmpty() ? String("OTA firmware selection was rejected.") : error;
            if (otaManager != nullptr) {
                otaManager->reportError(message);
            }
            appState->setLastError(message);
        }
        mqttManager->publishState();
    } else if (command.action == "ota_auto_update") {
        bool enabled = false;
        if (!payloadEnablesSwitch(command.payload, enabled)) {
            const String message = "OTA auto-update MQTT payload must be ON or OFF.";
            appState->setLastError(message);
            mqttManager->publishState();
            return;
        }

        deferredActions->pendingSettings = *settings;
        deferredActions->pendingSettings.ota.autoUpdate = enabled;
        if (enabled) {
            deferredActions->pendingSettings.ota.autoCheck = true;
        }
        deferredActions->settingsApplyPending = true;
        appState->setLastError("");
    } else if (command.action == "ota_install_latest") {
        if (otaManager != nullptr && otaManager->triggerCheck(true)) {
            appState->setLastError("");
        } else {
            const String message = "OTA install request was rejected.";
            if (otaManager != nullptr) {
                otaManager->reportError(message);
            }
            appState->setLastError(message);
        }
        mqttManager->publishState();
    } else if (command.action == "ota_install_selected") {
        String error;
        if (otaManager != nullptr && otaManager->triggerInstallSelected(error)) {
            appState->setLastError("");
        } else {
            const String message = error.isEmpty() ? String("OTA install request was rejected.") : error;
            if (otaManager != nullptr) {
                otaManager->reportError(message);
            }
            appState->setLastError(message);
        }
        mqttManager->publishState();
    } else if (command.action == "ota_install") {
        String error;
        if (otaManager != nullptr && otaManager->triggerInstallVersion(command.version, command.assetName, error)) {
            appState->setLastError("");
        } else {
            const String message = error.isEmpty() ? String("OTA install request was rejected.") : error;
            if (otaManager != nullptr) {
                otaManager->reportError(message);
            }
            appState->setLastError(message);
        }
        mqttManager->publishState();
    } else if (command.action == "alarm_start") {
        startAlarmPlayback();
        mqttManager->publishState();
    } else if (command.action == "alarm_stop") {
        stopAlarmPlayback();
        mqttManager->publishState();
    } else if (command.action == "notify") {
        if (!tryOverlayConfiguredEffect(settings->effects.notificationFile, 35, effectVolumeForSource("effect-notification"))) {
            playConfiguredEffectSource("effect-notification", command.payload.isEmpty() ? "MQTT Notification" : command.payload);
        }
    } else if (command.action == "sd_remount") {
        String message;
        if (storageBusy(StorageTarget::Sd)) {
            message = "SD card is busy. Stop playback or transfers before remounting.";
        } else if (remountStorageBackend(StorageTarget::Sd, *settings)) {
            appState->setLastError("");
            mqttManager->publishState();
            return;
        } else {
            message = "SD card remount failed.";
        }

        appState->setLastError(message);
        mqttManager->publishState();
    } else if (command.action == "reboot") {
        appState->setLastError("");
        requestRestartSequence("mqtt", false);
        mqttManager->publishState();
    } else if (command.action == "web_ui_lock") {
        if (webServer != nullptr) {
            webServer->setWebUiLocked(true);
        }
        appState->setLastError("Web UI locked. Send MQTT payload 'unlock' to <baseTopic>/cmd/web_ui to restore access.");
        mqttManager->publishState();
    } else if (command.action == "web_ui_unlock") {
        if (webServer != nullptr) {
            webServer->setWebUiLocked(false);
        }
        appState->setLastError("");
        mqttManager->publishState();
    } else if (command.action == "stop" || command.action == "pause") {
        stopAlarmPlayback();
        audioPlayer->stop();
        mqttManager->publishState();
    } else if (command.action == "display_trigger") {
        triggerWapeDisplay();
    } else if (command.action == "motor_run") {
        String error;
        if (motorController.runChannel(static_cast<uint8_t>(command.motorChannelIndex), command.motorForward, command.motorDurationMs, command.motorLimitInputIndex, error)) {
            appState->setLastError("");
        } else {
            appState->setLastError(error.isEmpty() ? String("Motor command failed.") : error);
        }
        mqttManager->publishState();
        lastPublishedMotorStateVersion = motorController.stateVersion();
    } else if (command.action == "motor_set_duration") {
        String error;
        if (updateMotorRuntimeDurationSetting(command.motorChannelIndex, command.motorForward, command.motorDurationMs, error)) {
            appState->setLastError("");
        } else {
            appState->setLastError(error.isEmpty() ? String("Motor duration update failed.") : error);
        }
        mqttManager->publishState();
    } else if (command.action == "volume") {
        settings->device.savedVolumePercent = command.volumePercent;
        audioPlayer->setVolumePercent(command.volumePercent);
        soundEffects->setVolumePercent(command.volumePercent);
        deferredActions->pendingVolume = command.volumePercent;
        deferredActions->volumePending = false;
        deferredActions->volumeSavePending = true;
        deferredActions->volumeSaveAt = millis() + kVolumePersistDelayMs;
        mqttManager->publishState();
    } else if (command.action == "play" && command.url.isEmpty()) {
        // Home Assistant media-source flows can emit a bare play command before
        // the real playmedia payload arrives. Replaying the current URL here
        // causes the previous source to start briefly and then switch.
        return;
    } else if (command.action == "playpause") {
        const AppStateSnapshot snapshot = appState->snapshot();
        if (snapshot.playback.state == "playing" || snapshot.playback.state == "buffering") {
            audioPlayer->stop();
            mqttManager->publishState();
        } else if (!snapshot.playback.url.isEmpty()) {
            String ignored;
            playRequest(snapshot.playback.url, snapshot.playback.title, snapshot.playback.type, snapshot.playback.source, ignored, true);
        }
    } else if (command.action == "next") {
        stepPlaybackHistory(1);
    } else if (command.action == "previous") {
        stepPlaybackHistory(-1);
    } else {
        runtimeAudio.alarmActive = false;
        restoreAmbientVolumeIfNeeded();
        scheduleAmbientResume();
        String ignored;
        playRequest(command.url, command.label, command.mediaType.isEmpty() ? command.action : command.mediaType, command.source, ignored, true);
    }
}

void processDeferredActions() {
    if (deferredActions == nullptr) {
        return;
    }

    if (deferredActions->settingsApplyPending) {
        flushPendingSettingsNow();
    }

    if (deferredActions->mqttConnectionChangePending) {
        String error;
        if (deferredActions->mqttConnectRequested) {
            if (!mqttManager->requestConnect(error) && appState != nullptr && !error.isEmpty()) {
                appState->setLastError(error);
            }
        } else {
            mqttManager->requestDisconnect(error);
        }
        deferredActions->mqttConnectionChangePending = false;
    }

    if (deferredActions->stopPending) {
        clearPreviewResumeState();
        audioPlayer->stop();
        deferredActions->stopPending = false;
        mqttManager->publishState();
    }

    if (deferredActions->volumePending) {
        settings->device.savedVolumePercent = deferredActions->pendingVolume;
        audioPlayer->setVolumePercent(deferredActions->pendingVolume);
        soundEffects->setVolumePercent(deferredActions->pendingVolume);
        deferredActions->volumePending = false;
        deferredActions->volumeSavePending = true;
        deferredActions->volumeSaveAt = millis() + kVolumePersistDelayMs;
        mqttManager->publishState();
    }

