elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (deferredActions->volumeSavePending && static_cast<long>(millis() - deferredActions->volumeSaveAt) >= 0) {
        settingsManager->save(*settings);
        deferredActions->volumeSavePending = false;
    }

    if (deferredActions->playPending) {
        const AppStateSnapshot playbackSnapshotBeforeStart = appState != nullptr ? appState->snapshot() : AppStateSnapshot{};
        bool started = false;
        if (deferredActions->playSource == "effect-ambient") {
            restoreEffectVolumeIfNeeded();
            runtimeAudio.ambientPreviousVolume = settings != nullptr ? settings->device.savedVolumePercent : runtimeAudio.ambientPreviousVolume;
            audioPlayer->setVolumePercent(ambientPlaybackVolumePercent());
            runtimeAudio.ambientVolumeApplied = true;
        } else {
            restoreAmbientVolumeIfNeeded();
            if (deferredActions->playSource.startsWith("effect-")) {
                audioPlayer->setVolumePercent(effectVolumeForSource(deferredActions->playSource));
                runtimeAudio.effectVolumeApplied = true;
            } else {
                restoreEffectVolumeIfNeeded();
                audioPlayer->setVolumePercent(settings != nullptr ? settings->device.savedVolumePercent : DefaultConfig::DEFAULT_VOLUME_PERCENT);
            }
        }
        if (deferredActions->playFromStorage) {
            started = audioPlayer->playStorageFile(
                deferredActions->playStorageTarget,
                deferredActions->playStoragePath,
                deferredActions->playLabel,
                deferredActions->playType,
                deferredActions->playSource);
        } else {
            started = audioPlayer->play(
                deferredActions->playUrl,
                deferredActions->playLabel,
                deferredActions->playType,
                deferredActions->playSource);
        }
        const bool previewSwitchFromAmbient =
            deferredActions->playFromStorage &&
            deferredActions->playSource.startsWith("effect-") &&
            deferredActions->playSource != "effect-ambient" &&
            playbackSnapshotBeforeStart.playback.source == "effect-ambient" &&
            (playbackSnapshotBeforeStart.playback.state == "playing" || playbackSnapshotBeforeStart.playback.state == "buffering");
        if (!started && previewSwitchFromAmbient) {
            delay(kEffectPreviewRetryDelayMs);
            if (deferredActions->playFromStorage) {
                started = audioPlayer->playStorageFile(
                    deferredActions->playStorageTarget,
                    deferredActions->playStoragePath,
                    deferredActions->playLabel,
                    deferredActions->playType,
                    deferredActions->playSource);
            }
        }
        if (started && deferredActions->playAddToHistory) {
            rememberPlaybackSelection(
                deferredActions->playUrl,
                deferredActions->playLabel,
                deferredActions->playType,
                deferredActions->playSource);
        }
        if (started) {
            persistResumablePlaybackSelection(
                deferredActions->playUrl,
                deferredActions->playLabel,
                deferredActions->playType,
                deferredActions->playSource,
                true);
            if (appState != nullptr) {
                appState->setLastError("");
            }
        } else if (appState != nullptr) {
            if (runtimeAudio.previewResumePending && deferredActions->playSource == runtimeAudio.previewActiveSource) {
                restoreEffectVolumeIfNeeded();
                resumeQueuedPreviewPlayback();
            }
            appState->setLastError(playbackStartFailureMessage(*deferredActions));
        }
        deferredActions->playPending = false;
        mqttManager->publishState();
    }
}

}  // namespace

void setup() {
    Serial.begin(115200);
    waitForSerialConsole();
    delay(200);
    beginSystemMetrics();

    const esp_reset_reason_t resetReason = esp_reset_reason();
    loadRollbackState();
    wokeFromDeepSleep = resetReason == ESP_RST_DEEPSLEEP;
    Serial.printf("\n[boot] app=%s version=%s built=%s\n", APP_NAME, APP_VERSION, APP_BUILD_DATE);
    Serial.printf("[boot] reset reason=%s (%d)\n", resetReasonToString(resetReason), static_cast<int>(resetReason));
    if (!lastRolledBackVersion.isEmpty()) {
        Serial.printf("[rollback] previous OTA rollback detected: version=%s reason=%s\n", lastRolledBackVersion.c_str(), lastRollbackReason.c_str());
    }
    if (otaPendingVerification) {
        Serial.printf("[rollback] running pending-verify image %s\n", otaPendingVersion.c_str());
    }
    Serial.flush();

    if (!initializeRuntimeObjects()) {
        Serial.println("[boot] failed to construct runtime objects");
        Serial.flush();
        if (otaPendingVerification) {
            rollbackAndReboot("Runtime objects failed to initialize during OTA health check.");
        }
        delay(1000);
        ESP.restart();
    }

    if (!appState->begin()) {
        Serial.println("[boot] failed to initialize app state mutex");
        Serial.flush();
    }

    settingsManager->begin();
    *settings = settingsManager->load();
    if (settings->device.powerCycleFactoryResetEnabled) {
        const uint8_t powerCycleCount = updatePowerCycleCounter(resetReason);
        if (powerCycleCount > 0) {
            Serial.printf("[boot-guard] power-cycle count=%u/%u\n",
                          static_cast<unsigned>(powerCycleCount),
                          static_cast<unsigned>(kPowerCycleFactoryResetThreshold));
        }
        if (powerCycleCount >= kPowerCycleFactoryResetThreshold) {
            Serial.println("[boot-guard] factory reset triggered by repeated power cycles");
            flashFactoryResetIndicator();
            settingsManager->reset();
            clearPowerCycleCounter();
            Serial.flush();
            delay(200);
            ESP.restart();
        }
        if (powerCycleCount > 0) {
            armPowerCycleCounterClear();
        }
    } else {
        clearPowerCycleCounter();
    }
    beginStorageBackends(*settings);
    activeStatusLedPin = settings->device.statusLedPin;
    activeWapeTriggerPin = settings->oled.displayType == "wape" ? settings->oled.wapeTriggerPin : 0;

    initializeButtons();

    initializeStatusLed();
    writeStatusLed(false);
    initializeWapeTriggerPin();

    displayManager->begin(settings->oled);
    displayManager->setBootMessage("Booting");

    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, settings->usingSavedSettings);

