elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (!previousMqttConnected && snapshot.network.mqttConnected) {
        soundEffects->playMqttConnected();
    }

    if (playbackStarted) {
        if (runtimeAudio.previewResumePending && snapshot.playback.source == runtimeAudio.previewResumeSource) {
            clearPreviewResumeState();
        }
        soundEffects->playPlaybackStart();
        if (snapshot.playback.source != "effect-ambient") {
            scheduleAmbientResume();
        }
        if (settings != nullptr && settings->oled.wapeTriggerEvent == "play_start") {
            requestWapeTriggerPulse();
        }
    } else if (playbackStopped) {
        soundEffects->playPlaybackStop();
    }

    if (playbackStopped) {
        if ((previousPlaybackType == "stream" || previousPlaybackType == "media") && !previousPlaybackSource.startsWith("effect-")) {
            setSavedPlaybackResumeAfterBoot(false);
        }
        restoreEffectVolumeIfNeeded();
        if (runtimeAudio.previewResumePending && previousPlaybackSource == runtimeAudio.previewActiveSource) {
            resumeQueuedPreviewPlayback();
        } else if (runtimeAudio.pendingCommandAfterNotification) {
            runtimeAudio.pendingCommandAfterNotification = false;
            executePlaybackCommand(runtimeAudio.pendingCommand);
        } else if (runtimeAudio.pendingAutoUpdateInstall) {
            runtimeAudio.pendingAutoUpdateInstall = false;
            String error;
            if (otaManager != nullptr && !snapshot.ota.latestVersion.isEmpty()) {
                otaManager->triggerInstallVersion(snapshot.ota.latestVersion, error);
            }
        } else if (runtimeAudio.restartPending) {
            if (previousPlaybackSource == "effect-update-success") {
                if (!playConfiguredEffectSource("effect-shutdown", "Restarting")) {
                    if (runtimeAudio.restartFactoryReset) {
                        factoryResetRequested = true;
                    }
                    runtimeAudio.restartPending = false;
                    runtimeAudio.restartForcePending = false;
                    scheduleReboot(250);
                }
            } else if (previousPlaybackSource == "effect-shutdown") {
                if (runtimeAudio.restartFactoryReset) {
                    factoryResetRequested = true;
                }
                runtimeAudio.restartPending = false;
                runtimeAudio.restartForcePending = false;
                scheduleReboot(250);
            }
        } else if (runtimeAudio.webUiLockPending && previousPlaybackSource == "effect-shutdown") {
            runtimeAudio.webUiLockPending = false;
            applyWebUiLockNow();
        } else if (runtimeAudio.alarmActive && previousPlaybackSource == "effect-alarm") {
            playConfiguredEffectSource("effect-alarm", "Alarm");
        } else if (previousPlaybackSource == "effect-ambient") {
            restoreAmbientVolumeIfNeeded();
            if (!runtimeAudio.alarmActive) {
                runtimeAudio.ambientPreviousVolume = settings->device.savedVolumePercent;
                audioPlayer->setVolumePercent(ambientPlaybackVolumePercent());
                runtimeAudio.ambientVolumeApplied = true;
                if (!playConfiguredEffectSource("effect-ambient", "Ambient Sound")) {
                    restoreAmbientVolumeIfNeeded();
                    scheduleAmbientResume(kAmbientResumeDelayMs);
                }
            }
        } else if (previousPlaybackSource == "effect-low-battery") {
            runtimeAudio.lowBatteryCueActive = false;
        }
    }

    if (!runtimeAudio.updateAvailableHandled && snapshot.ota.updateAvailable && !snapshot.ota.latestVersion.isEmpty()) {
        runtimeAudio.updateAvailableHandled = true;
        runtimeAudio.pendingAutoUpdateInstall = settings->ota.autoUpdate;
        const bool playedUpdateAvailableCue =
            tryOverlayConfiguredEffect(settings->effects.updateAvailableFile, 40, effectVolumeForSource("effect-update-available")) ||
            playConfiguredEffectSource("effect-update-available", "Update Available");
        if (!playedUpdateAvailableCue && runtimeAudio.pendingAutoUpdateInstall) {
            runtimeAudio.pendingAutoUpdateInstall = false;
            String error;
            if (otaManager != nullptr) {
                otaManager->triggerInstallVersion(snapshot.ota.latestVersion, error);
            }
        }
    } else if (!snapshot.ota.updateAvailable) {
        runtimeAudio.updateAvailableHandled = false;
    }

    if (!previousCharging && snapshot.battery.charging) {
        if (settings != nullptr && settings->oled.wapeTriggerEvent == "charging_start") {
            requestWapeTriggerPulse();
        }
    }

    previousWifiConnected = snapshot.network.wifiConnected;
    previousMqttConnected = snapshot.network.mqttConnected;
    previousPlaybackState = snapshot.playback.state;
    previousPlaybackSource = snapshot.playback.source;
    previousPlaybackType = snapshot.playback.type;
    previousCharging = snapshot.battery.charging;
}

void serviceRuntimeAudioAutomation(const AppStateSnapshot& snapshot) {
    if (settings == nullptr) {
        return;
    }

    if (runtimeAudio.startupEffectPending && snapshot.playback.state != "playing" && snapshot.playback.state != "buffering") {
        const bool eligible = runtimeAudio.startupEffectEligibleAt != 0 && static_cast<long>(millis() - runtimeAudio.startupEffectEligibleAt) >= 0;
        if (eligible && deferredActions != nullptr && !deferredActions->playPending) {
            const String startupEffectRef = effectFileForSource("effect-startup");
            StorageTarget storageTarget = StorageTarget::Flash;
            String storagePath;
            const bool storageReference = parseStorageFileReference(startupEffectRef, storageTarget, storagePath);
            if (startupEffectRef.isEmpty()) {
                runtimeAudio.startupEffectPending = false;
                runtimeAudio.startupEffectAttempts = 0;
            } else {
                if (storageReference && !storageMounted(storageTarget)) {
                    remountActiveStorageBackend(storageTarget);
                }

                runtimeAudio.startupEffectAttempts++;
                String startupEffectError;
                if (playConfiguredEffect(startupEffectRef, "Startup", "effect-startup", &startupEffectError)) {
                    runtimeAudio.startupEffectPending = false;
                    runtimeAudio.startupEffectAttempts = 0;
                } else {
                    const bool retryableStorageFailure = storageReference && runtimeAudio.startupEffectAttempts < kStartupEffectMaxAttempts;
                    if (retryableStorageFailure) {
                        runtimeAudio.startupEffectEligibleAt = millis() + kStartupEffectRetryDelayMs;
                        Serial.printf("[effect] startup retry %u/%u pending: %s\n",
                                      static_cast<unsigned>(runtimeAudio.startupEffectAttempts),
                                      static_cast<unsigned>(kStartupEffectMaxAttempts),
                                      startupEffectError.c_str());
                    } else {
                        runtimeAudio.startupEffectPending = false;
                        runtimeAudio.startupEffectAttempts = 0;
                        if (!startupEffectError.isEmpty()) {
                            Serial.printf("[effect] startup not played: %s\n", startupEffectError.c_str());
                            if (appState != nullptr) {
                                appState->setLastError(startupEffectError);
                            }
                        }
                    }
                }
            }
        }
    }

