elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (runtimeAudio.previewResumePending && !runtimeAudio.previewResumeUrl.isEmpty() &&
        snapshot.playback.state != "playing" && snapshot.playback.state != "buffering") {
        StorageTarget storageTarget = StorageTarget::Flash;
        String storagePath;
        const bool storageReference = parseStorageFileReference(runtimeAudio.previewResumeUrl, storageTarget, storagePath);
        const bool resumeReady = storageReference ? storageMounted(storageTarget) : (wifiManager != nullptr && wifiManager->isConnected());
        if (resumeReady) {
            resumeQueuedPreviewPlayback();
        }
    }

    if (audioPlayer != nullptr && audioPlayer->consumeOverlayFinished() && runtimeAudio.pendingAutoUpdateInstall) {
        runtimeAudio.pendingAutoUpdateInstall = false;
        String error;
        if (otaManager != nullptr && !snapshot.ota.latestVersion.isEmpty()) {
            otaManager->triggerInstallVersion(snapshot.ota.latestVersion, error);
        }
    }

    if (runtimeAudio.bootUpdateCheckQueued && wifiManager != nullptr && wifiManager->isConnected() && otaManager != nullptr && !snapshot.ota.busy) {
        runtimeAudio.bootUpdateCheckQueued = false;
        otaManager->triggerCheck(false);
    }

    if (!runtimeAudio.startupEffectPending && runtimeAudio.resumeSavedPlaybackPending && snapshot.playback.state != "playing" && snapshot.playback.state != "buffering") {
        StorageTarget storageTarget = StorageTarget::Flash;
        String storagePath;
        const bool storageReference = settings != nullptr && parseStorageFileReference(settings->audio.lastPlayback.url, storageTarget, storagePath);
        const bool resumeReady = storageReference || (wifiManager != nullptr && wifiManager->isConnected());
        if (resumeReady) {
            runtimeAudio.resumeSavedPlaybackPending = false;
            queueSavedPlaybackResume();
        }
    }

    const uint8_t batteryPercent = estimateBatteryPercent(snapshot.battery.voltage);
    if (batteryPercent > settings->device.lowBatterySleepThresholdPercent) {
        runtimeAudio.lowBatteryCueActive = false;
    } else if (!runtimeAudio.lowBatteryCueActive && !settings->effects.lowBatteryFile.isEmpty() && !runtimeAudio.alarmActive && !runtimeAudio.restartPending) {
        runtimeAudio.lowBatteryCueActive =
            tryOverlayConfiguredEffect(settings->effects.lowBatteryFile, 40, effectVolumeForSource("effect-low-battery")) ||
            playConfiguredEffectSource("effect-low-battery", "Low Battery");
    }

    if (snapshot.playback.source != "effect-ambient") {
        startAmbientIfEligible(snapshot);
    }

    if (runtimeAudio.restartForcePending && static_cast<long>(millis() - runtimeAudio.restartForceAt) >= 0) {
        runtimeAudio.restartForcePending = false;
        runtimeAudio.restartPending = false;
        if (runtimeAudio.restartFactoryReset) {
            factoryResetRequested = true;
        }
        scheduleReboot(250);
    }
}

void serviceAudioDiagnosticTest() {
#if !APP_AUDIO_DIAGNOSTIC_TEST
    return;
#else
    static bool diagnosticAudioStartQueued = false;
    static unsigned long diagnosticAudioRetryAt = 0;

    if (appState == nullptr || audioPlayer == nullptr || wifiManager == nullptr) {
        return;
    }

    if (!wifiManager->isConnected()) {
        diagnosticAudioStartQueued = false;
        diagnosticAudioRetryAt = 0;
        return;
    }

    const AppStateSnapshot snapshot = appState->snapshot();
    if (snapshot.playback.state == "playing" || snapshot.playback.state == "buffering") {
        diagnosticAudioStartQueued = true;
        return;
    }

    if (diagnosticAudioRetryAt != 0 && static_cast<long>(millis() - diagnosticAudioRetryAt) < 0) {
        return;
    }

    audioPlayer->setDirectLibraryVolume(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME);
    const AudioPlayer::DiagnosticsSnapshot diagnostics = audioPlayer->diagnostics();
    Serial.printf("[audio-test] init driver=ESP32-audioI2S fmt=std-i2s preferred_rate=%lu stereo=%s bclk=%u ws=%u dout=%u lib_volume=%u url=%s\n",
                  static_cast<unsigned long>(diagnostics.requestedSampleRateHz),
                  diagnostics.stereoEnabled ? "on" : "off",
                  static_cast<unsigned>(activeI2sBclkPin),
                  static_cast<unsigned>(activeI2sWsPin),
                  static_cast<unsigned>(activeI2sDoutPin),
                  static_cast<unsigned>(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME),
                  DefaultConfig::AUDIO_DIAGNOSTIC_STREAM_URL);

    if (audioPlayer->play(DefaultConfig::AUDIO_DIAGNOSTIC_STREAM_URL, "MAX98357A Test Stream", "stream", "diagnostic-test")) {
        diagnosticAudioStartQueued = true;
        diagnosticAudioRetryAt = 0;
        return;
    }

    diagnosticAudioRetryAt = millis() + 5000UL;
    Serial.println("[audio-test] playback start failed, retrying in 5s");
#endif
}

void loop() {
    if (appState == nullptr || settingsManager == nullptr || wifiManager == nullptr || batteryMonitor == nullptr ||
        displayManager == nullptr || audioPlayer == nullptr || otaManager == nullptr || mqttManager == nullptr ||
        webServer == nullptr) {
        delay(100);
        return;
    }

    const unsigned long now = millis();
    processDeferredActions();
    serviceWapeTriggerPulse();
    if (now - lastInputPollAt >= kInputPollIntervalMs) {
        lastInputPollAt = now;
        pollPhysicalButtons();
    }
    motorController.loop();
    publishMotorStateIfNeeded();
    wifiManager->loop();
    serviceAudioDiagnosticTest();
    audioPlayer->loop();
    pollStorageBackends();
    const bool batteryUpdated = batteryMonitor->loop(isBatterySamplingAllowed());
    otaManager->loop();
    mqttManager->loop();

    const AppStateSnapshot snapshot = appState->snapshot();
    processSoundEffectTransitions(snapshot);
    serviceRuntimeAudioAutomation(snapshot);
    displayManager->loop(snapshot);
    handleLowBatterySleepPolicy(snapshot);
    confirmOtaHealthIfReady();

    publishOtaStateIfNeeded(snapshot);
    maybeClearPowerCycleCounterAfterStableBoot();

    if (millis() - lastHeapUpdateAt > 2000UL) {
        lastHeapUpdateAt = millis();
        sampleSystemMetrics();
        appState->setFreeHeap(getSystemMetricsSnapshot().freeHeapBytes);
        updateStatusLedForNetwork(wifiManager->isConnected(), wifiManager->isApMode());
    }

    if (batteryUpdated) {
        const BatteryReading reading = batteryMonitor->latest();
        mqttManager->publishBattery(reading.filteredVoltage, reading.rawAdcVoltage, reading.rawAdc, reading.charging);
        mqttManager->publishState();
    }

    if (factoryResetRequested) {
        settingsManager->reset();
        startFactoryResetLedBlink(millis());
        const unsigned long minimumRebootAt = millis() + kFactoryResetLedSuccessWindowMs;
        if (!rebootRequested || static_cast<long>(rebootAt - minimumRebootAt) < 0) {
            rebootRequested = true;
            rebootAt = minimumRebootAt;
        }
        factoryResetRequested = false;
    }

    serviceStatusLedOverrides(millis());

    if (!recoveryRebootScheduled && wifiManager->shouldRebootForRecovery()) {
        recoveryRebootScheduled = true;
        Serial.printf("[recovery] scheduling reboot after %u failed Wi-Fi attempts\n",
                      static_cast<unsigned>(wifiManager->consecutiveFailureCount()));
        Serial.flush();
        requestRestartSequence("wifi_recovery", false);
    }

    if (!recoveryRebootScheduled && mqttManager->shouldRebootForRecovery()) {
        recoveryRebootScheduled = true;
        Serial.printf("[recovery] scheduling reboot after %u failed MQTT attempts\n",
                      static_cast<unsigned>(mqttManager->consecutiveFailureCount()));
        Serial.flush();
        requestRestartSequence("mqtt_recovery", false);
    }

    if (rebootRequested && static_cast<long>(millis() - rebootAt) >= 0) {
        ESP.restart();
    }

    delay(1);
}

#endif
